export const letters = [
	'\u0621', // ء
	'\u0622', // آ
	'\u0623', // أ
	'\u0624', // ؤ
	'\u0625', // إ
	'\u0627', // ا
	'\u0628', // ب
	'\u0629', // ة
	'\u062A', // ت
	'\u062B', // ث
	'\u062C', // ج
	'\u062D', // ح
	'\u062E', // خ
	'\u062F', // د
	'\u0630', // ذ
	'\u0631', // ر
	'\u0632', // ز
	'\u0633', // س
	'\u0634', // ش
	'\u0635', // ص
	'\u0636', // ض
	'\u0637', // ط
	'\u0638', // ظ
	'\u0639', // ع
	'\u063A', // غ
	'\u0641', // ف
	'\u0642', // ق
	'\u0643', // ك
	'\u0644', // ل
	'\u0645', // م
	'\u0646', // ن
	'\u0647', // ه
	'\u0648', // و
	'\u0649', // ى
	'\u064A', // ي
]

export const Ar = {
	Hamza: '\u0621',
	AlefMadda: '\u0622',
	AlefHamza: '\u0623',
	WawHamza: '\u0624',
	AlefHamzaMaksura: '\u0625',
	Alef: '\u0627',
	Ba: '\u0628',
	TaMarbuta: '\u0629',
	Ta: '\u062A',
	Tha: '\u062B',
	Jeem: '\u062C',
	H7aa: '\u062D',
	Khaa: '\u062E',
	Dal: '\u062F',
	Thal: '\u0630',
	Ra: '\u0631',
	Zay: '\u0632',
	Seen: '\u0633',
	Sheen: '\u0634',
	Sad: '\u0635',
	Dad: '\u0636',
	TTa: '\u0637',
	THa: '\u0638',
	Ayn: '\u0639',
	Ghayn: '\u063A',
	Fa: '\u0641',
	Qaf: '\u0642',
	Kaf: '\u0643',
	Lam: '\u0644',
	Meem: '\u0645',
	Noon: '\u0646',
	Ha: '\u0647',
	Waw: '\u0648',
	AlefMaksura: '\u0649',
	Yaa: '\u064A',
}
